import { Breadcrumbs, Container, Layout } from '../../components'

import flatImage from '../../assets/flat.jpg'

import styles from './Catalog.module.scss'

const Catalog = () => {
	return (
		<Layout>
			<div className={styles.head}>
				<Container>
					<Breadcrumbs />
					<h1 className={styles.title}>
						Аренда квартир на сутки в Минске
					</h1>
					<div className={styles.recommend}>
						<h3 className={styles.recommendTitle}>
							Рекомендуем посмотреть
						</h3>
					</div>
				</Container>
			</div>
			<Container>
				<div className={styles.flats}>
					<h2 className={styles.found}>Найдено 234 результата</h2>
					<div className={styles.cards}>
						<div className={styles.card}>
							<span className={styles.gold}>Gold</span>
							<div className={styles.slider}>
								<img src={flatImage} alt='Flat' />
							</div>
							<div className={styles.content}>
								<div
									className={`${styles.row} ${styles.params}`}>
									<div className={styles.price}>
										65.00 BYN
										<span>за сутки</span>
									</div>
									<div className={styles.people}>
										<svg
											className={styles.peopleIcon}
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2431)'>
												<path
													d='M7.501 0.814453C5.35814 0.814453 3.60645 2.56615 3.60645 4.70902C3.60645 6.85189 5.35814 8.60358 7.501 8.60358C9.64387 8.60358 11.3956 6.85189 11.3956 4.70902C11.3956 2.56615 9.64387 0.814453 7.501 0.814453Z'
													fill='#686868'
												/>
												<path
													d='M14.1852 11.7165C14.0832 11.4613 13.9471 11.2233 13.7941 11.0022C13.0118 9.84569 11.8043 9.08039 10.4438 8.89331C10.2737 8.87632 10.0866 8.9103 9.95056 9.01235C9.23627 9.53957 8.38595 9.81167 7.50157 9.81167C6.6172 9.81167 5.76687 9.53957 5.05258 9.01235C4.91651 8.9103 4.72944 8.85929 4.55938 8.89331C3.19884 9.08039 1.97436 9.84569 1.20906 11.0022C1.056 11.2233 0.919931 11.4784 0.817913 11.7165C0.766903 11.8185 0.783896 11.9376 0.834905 12.0396C0.970972 12.2777 1.14102 12.5158 1.29408 12.7199C1.53217 13.043 1.78728 13.3321 2.07641 13.6042C2.31449 13.8423 2.5866 14.0634 2.85873 14.2845C4.20225 15.2879 5.81791 15.8151 7.48458 15.8151C9.15125 15.8151 10.7669 15.2879 12.1104 14.2845C12.3825 14.0804 12.6546 13.8423 12.8927 13.6042C13.1649 13.3321 13.437 13.043 13.6751 12.7199C13.8451 12.4988 13.9982 12.2777 14.1343 12.0396C14.2192 11.9376 14.2362 11.8185 14.1852 11.7165Z'
													fill='#686868'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2431'>
													<rect
														width='15'
														height='15'
														fill='white'
														transform='translate(0 0.814453)'
													/>
												</clipPath>
											</defs>
										</svg>
										<span>4 (2+2)</span>
									</div>
									<div className={styles.roomsCount}>
										4 комн.
									</div>
								</div>
								<div className={styles.address}>
									<div className={styles.location}>
										<svg
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2475)'>
												<path
													d='M12.462 3.17459C11.3632 1.4441 9.54923 0.470703 7.50853 0.470703C5.48528 0.470703 3.67132 1.4441 2.5376 3.17459C1.40388 4.86902 1.14225 7.03212 1.83993 8.92484C2.03179 9.42957 2.3283 9.95232 2.71202 10.421L7.12481 15.7927C7.22946 15.9009 7.33412 15.973 7.49109 15.973C7.64807 15.973 7.75272 15.9009 7.85737 15.7927L12.2876 10.421C12.6713 9.95232 12.9853 9.44759 13.1597 8.92484C13.8574 7.03212 13.5957 4.86902 12.462 3.17459ZM7.50853 9.55575C6.00853 9.55575 4.77016 8.27591 4.77016 6.72568C4.77016 5.17546 6.00853 3.89562 7.50853 3.89562C9.00853 3.89562 10.2469 5.17546 10.2469 6.72568C10.2469 8.27591 9.02598 9.55575 7.50853 9.55575Z'
													fill='#BDBDBD'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2475'>
													<rect
														width='15'
														height='15.5023'
														fill='white'
														transform='translate(0 0.470703)'
													/>
												</clipPath>
											</defs>
										</svg>
										Минск, б-р Мулявина, д. 10
									</div>
									<div
										className={`${styles.row} ${styles.addressRow}`}>
										<div className={styles.metro}>
											<svg
												width='20'
												height='22'
												viewBox='0 0 20 22'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M19.6401 15.4968H18.3812L14.4755 4.5293L9.99979 11.219L5.21594 4.6088L1.61882 15.4968H0.359905L0 16.9569H4.77911L6.65514 11.6193L10.0565 16.3138L10.0769 16.3433L10.0978 16.3138L13.3449 11.6193L15.2209 16.9569H20L19.6401 15.4968Z'
													fill='#BDBDBD'
												/>
											</svg>
											Грушевка
										</div>
										<div className={styles.district}>
											<span
												className={
													styles.circle
												}></span>
											Шабаны
										</div>
									</div>
									<div className={styles.description}>
										<p>
											Какое-то описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание Какое-то описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание Какое-то описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание Какое-то
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание
										</p>
									</div>
									<span className={styles.line}></span>
									<div className={styles.bottom}>
										<div className={styles.addToFav}>
											<svg
												height='15px'
												width='15px'
												version='1.1'
												id='Layer_1'
												viewBox='0 0 512.002 512.002'>
												<path
													fill='#FF877F'
													d='M54.039,272.547c-54.903-54.903-54.903-144.222,0-199.125c26.59-26.59,61.943-41.233,99.558-41.233
	c33.502,0,66.21,12.442,92.109,35.038l10.291,9.617l9.967-9.318c26.223-22.895,58.931-35.337,92.433-35.337
	c37.615,0,72.969,14.643,99.558,41.233c54.903,54.903,54.903,144.222,0,199.125L255.998,474.506L54.039,272.547z'
												/>
												<path
													fill='#573A32'
													d='M358.398,19.389c-36.779,0-73.259,13.662-102.4,39.919c-29.15-26.257-65.621-39.919-102.4-39.919
	c-39.313,0-78.618,14.993-108.612,44.988c-59.981,59.981-59.981,157.235,0,217.225l211.012,211.012L467.01,281.601
	C527,221.612,527,124.366,467.01,64.377C437.016,34.382,397.711,19.389,358.398,19.389z M448.911,263.502L255.998,456.406
	L63.085,263.502c-49.903-49.911-49.903-131.115,0-181.018c24.175-24.175,56.32-37.487,90.513-37.487
	c31.206,0,60.399,11.563,83.695,31.889l18.705,17.485l18.714-17.493c23.296-20.318,52.489-31.889,83.686-31.889
	c34.193,0,66.33,13.312,90.513,37.487C498.814,132.387,498.814,213.59,448.911,263.502z'
												/>
											</svg>
										</div>
										<div className={styles.contacts}>
											<svg
												width='16'
												height='15'
												viewBox='0 0 16 15'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M10.7275 0L5.2729 0C4.33199 0 3.56836 0.763626 3.56836 1.70454V13.2955C3.56836 14.2364 4.33199 15 5.2729 15H10.7275C11.6684 15 12.432 14.2364 12.432 13.2955V1.70454C12.432 0.763626 11.6684 0 10.7275 0ZM8.00019 14.3182C7.43427 14.3182 6.97746 13.8614 6.97746 13.2955C6.97746 12.7295 7.43427 12.2727 8.00019 12.2727C8.56611 12.2727 9.02292 12.7295 9.02292 13.2955C9.02292 13.8614 8.56608 14.3182 8.00019 14.3182ZM11.0684 11.5909H4.93201V2.04546H11.0684V11.5909Z'
													fill='#664EF9'
												/>
											</svg>
											<span>Контакты</span>
										</div>
										<div className={styles.more}>
											Подробнее
										</div>
									</div>
								</div>
							</div>
						</div>
						<div className={styles.card}>
							<span className={styles.gold}>Gold</span>
							<div className={styles.slider}>
								<img src={flatImage} alt='Flat' />
							</div>
							<div className={styles.content}>
								<div
									className={`${styles.row} ${styles.params}`}>
									<div className={styles.price}>
										65.00 BYN
										<span>за сутки</span>
									</div>
									<div className={styles.people}>
										<svg
											className={styles.peopleIcon}
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2431)'>
												<path
													d='M7.501 0.814453C5.35814 0.814453 3.60645 2.56615 3.60645 4.70902C3.60645 6.85189 5.35814 8.60358 7.501 8.60358C9.64387 8.60358 11.3956 6.85189 11.3956 4.70902C11.3956 2.56615 9.64387 0.814453 7.501 0.814453Z'
													fill='#686868'
												/>
												<path
													d='M14.1852 11.7165C14.0832 11.4613 13.9471 11.2233 13.7941 11.0022C13.0118 9.84569 11.8043 9.08039 10.4438 8.89331C10.2737 8.87632 10.0866 8.9103 9.95056 9.01235C9.23627 9.53957 8.38595 9.81167 7.50157 9.81167C6.6172 9.81167 5.76687 9.53957 5.05258 9.01235C4.91651 8.9103 4.72944 8.85929 4.55938 8.89331C3.19884 9.08039 1.97436 9.84569 1.20906 11.0022C1.056 11.2233 0.919931 11.4784 0.817913 11.7165C0.766903 11.8185 0.783896 11.9376 0.834905 12.0396C0.970972 12.2777 1.14102 12.5158 1.29408 12.7199C1.53217 13.043 1.78728 13.3321 2.07641 13.6042C2.31449 13.8423 2.5866 14.0634 2.85873 14.2845C4.20225 15.2879 5.81791 15.8151 7.48458 15.8151C9.15125 15.8151 10.7669 15.2879 12.1104 14.2845C12.3825 14.0804 12.6546 13.8423 12.8927 13.6042C13.1649 13.3321 13.437 13.043 13.6751 12.7199C13.8451 12.4988 13.9982 12.2777 14.1343 12.0396C14.2192 11.9376 14.2362 11.8185 14.1852 11.7165Z'
													fill='#686868'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2431'>
													<rect
														width='15'
														height='15'
														fill='white'
														transform='translate(0 0.814453)'
													/>
												</clipPath>
											</defs>
										</svg>
										<span>4 (2+2)</span>
									</div>
									<div className={styles.roomsCount}>
										4 комн.
									</div>
								</div>
								<div className={styles.address}>
									<div className={styles.location}>
										<svg
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2475)'>
												<path
													d='M12.462 3.17459C11.3632 1.4441 9.54923 0.470703 7.50853 0.470703C5.48528 0.470703 3.67132 1.4441 2.5376 3.17459C1.40388 4.86902 1.14225 7.03212 1.83993 8.92484C2.03179 9.42957 2.3283 9.95232 2.71202 10.421L7.12481 15.7927C7.22946 15.9009 7.33412 15.973 7.49109 15.973C7.64807 15.973 7.75272 15.9009 7.85737 15.7927L12.2876 10.421C12.6713 9.95232 12.9853 9.44759 13.1597 8.92484C13.8574 7.03212 13.5957 4.86902 12.462 3.17459ZM7.50853 9.55575C6.00853 9.55575 4.77016 8.27591 4.77016 6.72568C4.77016 5.17546 6.00853 3.89562 7.50853 3.89562C9.00853 3.89562 10.2469 5.17546 10.2469 6.72568C10.2469 8.27591 9.02598 9.55575 7.50853 9.55575Z'
													fill='#BDBDBD'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2475'>
													<rect
														width='15'
														height='15.5023'
														fill='white'
														transform='translate(0 0.470703)'
													/>
												</clipPath>
											</defs>
										</svg>
										Минск, б-р Мулявина, д. 10
									</div>
									<div
										className={`${styles.row} ${styles.addressRow}`}>
										<div className={styles.metro}>
											<svg
												width='20'
												height='22'
												viewBox='0 0 20 22'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M19.6401 15.4968H18.3812L14.4755 4.5293L9.99979 11.219L5.21594 4.6088L1.61882 15.4968H0.359905L0 16.9569H4.77911L6.65514 11.6193L10.0565 16.3138L10.0769 16.3433L10.0978 16.3138L13.3449 11.6193L15.2209 16.9569H20L19.6401 15.4968Z'
													fill='#BDBDBD'
												/>
											</svg>
											Грушевка
										</div>
										<div className={styles.district}>
											<span
												className={
													styles.circle
												}></span>
											Шабаны
										</div>
									</div>
									<div className={styles.description}>
										<p>
											Какое-то описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание Какое-то описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание Какое-то описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание Какое-то
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание
										</p>
									</div>
									<span className={styles.line}></span>
									<div className={styles.bottom}>
										<div className={styles.addToFav}>
											<svg
												height='15px'
												width='15px'
												version='1.1'
												id='Layer_1'
												viewBox='0 0 512.002 512.002'>
												<path
													fill='#FF877F'
													d='M54.039,272.547c-54.903-54.903-54.903-144.222,0-199.125c26.59-26.59,61.943-41.233,99.558-41.233
	c33.502,0,66.21,12.442,92.109,35.038l10.291,9.617l9.967-9.318c26.223-22.895,58.931-35.337,92.433-35.337
	c37.615,0,72.969,14.643,99.558,41.233c54.903,54.903,54.903,144.222,0,199.125L255.998,474.506L54.039,272.547z'
												/>
												<path
													fill='#573A32'
													d='M358.398,19.389c-36.779,0-73.259,13.662-102.4,39.919c-29.15-26.257-65.621-39.919-102.4-39.919
	c-39.313,0-78.618,14.993-108.612,44.988c-59.981,59.981-59.981,157.235,0,217.225l211.012,211.012L467.01,281.601
	C527,221.612,527,124.366,467.01,64.377C437.016,34.382,397.711,19.389,358.398,19.389z M448.911,263.502L255.998,456.406
	L63.085,263.502c-49.903-49.911-49.903-131.115,0-181.018c24.175-24.175,56.32-37.487,90.513-37.487
	c31.206,0,60.399,11.563,83.695,31.889l18.705,17.485l18.714-17.493c23.296-20.318,52.489-31.889,83.686-31.889
	c34.193,0,66.33,13.312,90.513,37.487C498.814,132.387,498.814,213.59,448.911,263.502z'
												/>
											</svg>
										</div>
										<div className={styles.contacts}>
											<svg
												width='16'
												height='15'
												viewBox='0 0 16 15'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M10.7275 0L5.2729 0C4.33199 0 3.56836 0.763626 3.56836 1.70454V13.2955C3.56836 14.2364 4.33199 15 5.2729 15H10.7275C11.6684 15 12.432 14.2364 12.432 13.2955V1.70454C12.432 0.763626 11.6684 0 10.7275 0ZM8.00019 14.3182C7.43427 14.3182 6.97746 13.8614 6.97746 13.2955C6.97746 12.7295 7.43427 12.2727 8.00019 12.2727C8.56611 12.2727 9.02292 12.7295 9.02292 13.2955C9.02292 13.8614 8.56608 14.3182 8.00019 14.3182ZM11.0684 11.5909H4.93201V2.04546H11.0684V11.5909Z'
													fill='#664EF9'
												/>
											</svg>
											<span>Контакты</span>
										</div>
										<div className={styles.more}>
											Подробнее
										</div>
									</div>
								</div>
							</div>
						</div>
						<div className={styles.card}>
							<span className={styles.gold}>Gold</span>
							<div className={styles.slider}>
								<img src={flatImage} alt='Flat' />
							</div>
							<div className={styles.content}>
								<div
									className={`${styles.row} ${styles.params}`}>
									<div className={styles.price}>
										65.00 BYN
										<span>за сутки</span>
									</div>
									<div className={styles.people}>
										<svg
											className={styles.peopleIcon}
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2431)'>
												<path
													d='M7.501 0.814453C5.35814 0.814453 3.60645 2.56615 3.60645 4.70902C3.60645 6.85189 5.35814 8.60358 7.501 8.60358C9.64387 8.60358 11.3956 6.85189 11.3956 4.70902C11.3956 2.56615 9.64387 0.814453 7.501 0.814453Z'
													fill='#686868'
												/>
												<path
													d='M14.1852 11.7165C14.0832 11.4613 13.9471 11.2233 13.7941 11.0022C13.0118 9.84569 11.8043 9.08039 10.4438 8.89331C10.2737 8.87632 10.0866 8.9103 9.95056 9.01235C9.23627 9.53957 8.38595 9.81167 7.50157 9.81167C6.6172 9.81167 5.76687 9.53957 5.05258 9.01235C4.91651 8.9103 4.72944 8.85929 4.55938 8.89331C3.19884 9.08039 1.97436 9.84569 1.20906 11.0022C1.056 11.2233 0.919931 11.4784 0.817913 11.7165C0.766903 11.8185 0.783896 11.9376 0.834905 12.0396C0.970972 12.2777 1.14102 12.5158 1.29408 12.7199C1.53217 13.043 1.78728 13.3321 2.07641 13.6042C2.31449 13.8423 2.5866 14.0634 2.85873 14.2845C4.20225 15.2879 5.81791 15.8151 7.48458 15.8151C9.15125 15.8151 10.7669 15.2879 12.1104 14.2845C12.3825 14.0804 12.6546 13.8423 12.8927 13.6042C13.1649 13.3321 13.437 13.043 13.6751 12.7199C13.8451 12.4988 13.9982 12.2777 14.1343 12.0396C14.2192 11.9376 14.2362 11.8185 14.1852 11.7165Z'
													fill='#686868'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2431'>
													<rect
														width='15'
														height='15'
														fill='white'
														transform='translate(0 0.814453)'
													/>
												</clipPath>
											</defs>
										</svg>
										<span>4 (2+2)</span>
									</div>
									<div className={styles.roomsCount}>
										4 комн.
									</div>
								</div>
								<div className={styles.address}>
									<div className={styles.location}>
										<svg
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2475)'>
												<path
													d='M12.462 3.17459C11.3632 1.4441 9.54923 0.470703 7.50853 0.470703C5.48528 0.470703 3.67132 1.4441 2.5376 3.17459C1.40388 4.86902 1.14225 7.03212 1.83993 8.92484C2.03179 9.42957 2.3283 9.95232 2.71202 10.421L7.12481 15.7927C7.22946 15.9009 7.33412 15.973 7.49109 15.973C7.64807 15.973 7.75272 15.9009 7.85737 15.7927L12.2876 10.421C12.6713 9.95232 12.9853 9.44759 13.1597 8.92484C13.8574 7.03212 13.5957 4.86902 12.462 3.17459ZM7.50853 9.55575C6.00853 9.55575 4.77016 8.27591 4.77016 6.72568C4.77016 5.17546 6.00853 3.89562 7.50853 3.89562C9.00853 3.89562 10.2469 5.17546 10.2469 6.72568C10.2469 8.27591 9.02598 9.55575 7.50853 9.55575Z'
													fill='#BDBDBD'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2475'>
													<rect
														width='15'
														height='15.5023'
														fill='white'
														transform='translate(0 0.470703)'
													/>
												</clipPath>
											</defs>
										</svg>
										Минск, б-р Мулявина, д. 10
									</div>
									<div
										className={`${styles.row} ${styles.addressRow}`}>
										<div className={styles.metro}>
											<svg
												width='20'
												height='22'
												viewBox='0 0 20 22'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M19.6401 15.4968H18.3812L14.4755 4.5293L9.99979 11.219L5.21594 4.6088L1.61882 15.4968H0.359905L0 16.9569H4.77911L6.65514 11.6193L10.0565 16.3138L10.0769 16.3433L10.0978 16.3138L13.3449 11.6193L15.2209 16.9569H20L19.6401 15.4968Z'
													fill='#BDBDBD'
												/>
											</svg>
											Грушевка
										</div>
										<div className={styles.district}>
											<span
												className={
													styles.circle
												}></span>
											Шабаны
										</div>
									</div>
									<div className={styles.description}>
										<p>
											Какое-то описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание Какое-то описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание Какое-то описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание Какое-то
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание
										</p>
									</div>
									<span className={styles.line}></span>
									<div className={styles.bottom}>
										<div className={styles.addToFav}>
											<svg
												height='15px'
												width='15px'
												version='1.1'
												id='Layer_1'
												viewBox='0 0 512.002 512.002'>
												<path
													fill='#FF877F'
													d='M54.039,272.547c-54.903-54.903-54.903-144.222,0-199.125c26.59-26.59,61.943-41.233,99.558-41.233
	c33.502,0,66.21,12.442,92.109,35.038l10.291,9.617l9.967-9.318c26.223-22.895,58.931-35.337,92.433-35.337
	c37.615,0,72.969,14.643,99.558,41.233c54.903,54.903,54.903,144.222,0,199.125L255.998,474.506L54.039,272.547z'
												/>
												<path
													fill='#573A32'
													d='M358.398,19.389c-36.779,0-73.259,13.662-102.4,39.919c-29.15-26.257-65.621-39.919-102.4-39.919
	c-39.313,0-78.618,14.993-108.612,44.988c-59.981,59.981-59.981,157.235,0,217.225l211.012,211.012L467.01,281.601
	C527,221.612,527,124.366,467.01,64.377C437.016,34.382,397.711,19.389,358.398,19.389z M448.911,263.502L255.998,456.406
	L63.085,263.502c-49.903-49.911-49.903-131.115,0-181.018c24.175-24.175,56.32-37.487,90.513-37.487
	c31.206,0,60.399,11.563,83.695,31.889l18.705,17.485l18.714-17.493c23.296-20.318,52.489-31.889,83.686-31.889
	c34.193,0,66.33,13.312,90.513,37.487C498.814,132.387,498.814,213.59,448.911,263.502z'
												/>
											</svg>
										</div>
										<div className={styles.contacts}>
											<svg
												width='16'
												height='15'
												viewBox='0 0 16 15'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M10.7275 0L5.2729 0C4.33199 0 3.56836 0.763626 3.56836 1.70454V13.2955C3.56836 14.2364 4.33199 15 5.2729 15H10.7275C11.6684 15 12.432 14.2364 12.432 13.2955V1.70454C12.432 0.763626 11.6684 0 10.7275 0ZM8.00019 14.3182C7.43427 14.3182 6.97746 13.8614 6.97746 13.2955C6.97746 12.7295 7.43427 12.2727 8.00019 12.2727C8.56611 12.2727 9.02292 12.7295 9.02292 13.2955C9.02292 13.8614 8.56608 14.3182 8.00019 14.3182ZM11.0684 11.5909H4.93201V2.04546H11.0684V11.5909Z'
													fill='#664EF9'
												/>
											</svg>
											<span>Контакты</span>
										</div>
										<div className={styles.more}>
											Подробнее
										</div>
									</div>
								</div>
							</div>
						</div>
						<div className={styles.card}>
							<span className={styles.gold}>Gold</span>
							<div className={styles.slider}>
								<img src={flatImage} alt='Flat' />
							</div>
							<div className={styles.content}>
								<div
									className={`${styles.row} ${styles.params}`}>
									<div className={styles.price}>
										65.00 BYN
										<span>за сутки</span>
									</div>
									<div className={styles.people}>
										<svg
											className={styles.peopleIcon}
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2431)'>
												<path
													d='M7.501 0.814453C5.35814 0.814453 3.60645 2.56615 3.60645 4.70902C3.60645 6.85189 5.35814 8.60358 7.501 8.60358C9.64387 8.60358 11.3956 6.85189 11.3956 4.70902C11.3956 2.56615 9.64387 0.814453 7.501 0.814453Z'
													fill='#686868'
												/>
												<path
													d='M14.1852 11.7165C14.0832 11.4613 13.9471 11.2233 13.7941 11.0022C13.0118 9.84569 11.8043 9.08039 10.4438 8.89331C10.2737 8.87632 10.0866 8.9103 9.95056 9.01235C9.23627 9.53957 8.38595 9.81167 7.50157 9.81167C6.6172 9.81167 5.76687 9.53957 5.05258 9.01235C4.91651 8.9103 4.72944 8.85929 4.55938 8.89331C3.19884 9.08039 1.97436 9.84569 1.20906 11.0022C1.056 11.2233 0.919931 11.4784 0.817913 11.7165C0.766903 11.8185 0.783896 11.9376 0.834905 12.0396C0.970972 12.2777 1.14102 12.5158 1.29408 12.7199C1.53217 13.043 1.78728 13.3321 2.07641 13.6042C2.31449 13.8423 2.5866 14.0634 2.85873 14.2845C4.20225 15.2879 5.81791 15.8151 7.48458 15.8151C9.15125 15.8151 10.7669 15.2879 12.1104 14.2845C12.3825 14.0804 12.6546 13.8423 12.8927 13.6042C13.1649 13.3321 13.437 13.043 13.6751 12.7199C13.8451 12.4988 13.9982 12.2777 14.1343 12.0396C14.2192 11.9376 14.2362 11.8185 14.1852 11.7165Z'
													fill='#686868'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2431'>
													<rect
														width='15'
														height='15'
														fill='white'
														transform='translate(0 0.814453)'
													/>
												</clipPath>
											</defs>
										</svg>
										<span>4 (2+2)</span>
									</div>
									<div className={styles.roomsCount}>
										4 комн.
									</div>
								</div>
								<div className={styles.address}>
									<div className={styles.location}>
										<svg
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2475)'>
												<path
													d='M12.462 3.17459C11.3632 1.4441 9.54923 0.470703 7.50853 0.470703C5.48528 0.470703 3.67132 1.4441 2.5376 3.17459C1.40388 4.86902 1.14225 7.03212 1.83993 8.92484C2.03179 9.42957 2.3283 9.95232 2.71202 10.421L7.12481 15.7927C7.22946 15.9009 7.33412 15.973 7.49109 15.973C7.64807 15.973 7.75272 15.9009 7.85737 15.7927L12.2876 10.421C12.6713 9.95232 12.9853 9.44759 13.1597 8.92484C13.8574 7.03212 13.5957 4.86902 12.462 3.17459ZM7.50853 9.55575C6.00853 9.55575 4.77016 8.27591 4.77016 6.72568C4.77016 5.17546 6.00853 3.89562 7.50853 3.89562C9.00853 3.89562 10.2469 5.17546 10.2469 6.72568C10.2469 8.27591 9.02598 9.55575 7.50853 9.55575Z'
													fill='#BDBDBD'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2475'>
													<rect
														width='15'
														height='15.5023'
														fill='white'
														transform='translate(0 0.470703)'
													/>
												</clipPath>
											</defs>
										</svg>
										Минск, б-р Мулявина, д. 10
									</div>
									<div
										className={`${styles.row} ${styles.addressRow}`}>
										<div className={styles.metro}>
											<svg
												width='20'
												height='22'
												viewBox='0 0 20 22'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M19.6401 15.4968H18.3812L14.4755 4.5293L9.99979 11.219L5.21594 4.6088L1.61882 15.4968H0.359905L0 16.9569H4.77911L6.65514 11.6193L10.0565 16.3138L10.0769 16.3433L10.0978 16.3138L13.3449 11.6193L15.2209 16.9569H20L19.6401 15.4968Z'
													fill='#BDBDBD'
												/>
											</svg>
											Грушевка
										</div>
										<div className={styles.district}>
											<span
												className={
													styles.circle
												}></span>
											Шабаны
										</div>
									</div>
									<div className={styles.description}>
										<p>
											Какое-то описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание Какое-то описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание Какое-то описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание Какое-то
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание
										</p>
									</div>
									<span className={styles.line}></span>
									<div className={styles.bottom}>
										<div className={styles.addToFav}>
											<svg
												height='15px'
												width='15px'
												version='1.1'
												id='Layer_1'
												viewBox='0 0 512.002 512.002'>
												<path
													fill='#FF877F'
													d='M54.039,272.547c-54.903-54.903-54.903-144.222,0-199.125c26.59-26.59,61.943-41.233,99.558-41.233
	c33.502,0,66.21,12.442,92.109,35.038l10.291,9.617l9.967-9.318c26.223-22.895,58.931-35.337,92.433-35.337
	c37.615,0,72.969,14.643,99.558,41.233c54.903,54.903,54.903,144.222,0,199.125L255.998,474.506L54.039,272.547z'
												/>
												<path
													fill='#573A32'
													d='M358.398,19.389c-36.779,0-73.259,13.662-102.4,39.919c-29.15-26.257-65.621-39.919-102.4-39.919
	c-39.313,0-78.618,14.993-108.612,44.988c-59.981,59.981-59.981,157.235,0,217.225l211.012,211.012L467.01,281.601
	C527,221.612,527,124.366,467.01,64.377C437.016,34.382,397.711,19.389,358.398,19.389z M448.911,263.502L255.998,456.406
	L63.085,263.502c-49.903-49.911-49.903-131.115,0-181.018c24.175-24.175,56.32-37.487,90.513-37.487
	c31.206,0,60.399,11.563,83.695,31.889l18.705,17.485l18.714-17.493c23.296-20.318,52.489-31.889,83.686-31.889
	c34.193,0,66.33,13.312,90.513,37.487C498.814,132.387,498.814,213.59,448.911,263.502z'
												/>
											</svg>
										</div>
										<div className={styles.contacts}>
											<svg
												width='16'
												height='15'
												viewBox='0 0 16 15'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M10.7275 0L5.2729 0C4.33199 0 3.56836 0.763626 3.56836 1.70454V13.2955C3.56836 14.2364 4.33199 15 5.2729 15H10.7275C11.6684 15 12.432 14.2364 12.432 13.2955V1.70454C12.432 0.763626 11.6684 0 10.7275 0ZM8.00019 14.3182C7.43427 14.3182 6.97746 13.8614 6.97746 13.2955C6.97746 12.7295 7.43427 12.2727 8.00019 12.2727C8.56611 12.2727 9.02292 12.7295 9.02292 13.2955C9.02292 13.8614 8.56608 14.3182 8.00019 14.3182ZM11.0684 11.5909H4.93201V2.04546H11.0684V11.5909Z'
													fill='#664EF9'
												/>
											</svg>
											<span>Контакты</span>
										</div>
										<div className={styles.more}>
											Подробнее
										</div>
									</div>
								</div>
							</div>
						</div>
						<div className={styles.card}>
							<span className={styles.gold}>Gold</span>
							<div className={styles.slider}>
								<img src={flatImage} alt='Flat' />
							</div>
							<div className={styles.content}>
								<div
									className={`${styles.row} ${styles.params}`}>
									<div className={styles.price}>
										65.00 BYN
										<span>за сутки</span>
									</div>
									<div className={styles.people}>
										<svg
											className={styles.peopleIcon}
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2431)'>
												<path
													d='M7.501 0.814453C5.35814 0.814453 3.60645 2.56615 3.60645 4.70902C3.60645 6.85189 5.35814 8.60358 7.501 8.60358C9.64387 8.60358 11.3956 6.85189 11.3956 4.70902C11.3956 2.56615 9.64387 0.814453 7.501 0.814453Z'
													fill='#686868'
												/>
												<path
													d='M14.1852 11.7165C14.0832 11.4613 13.9471 11.2233 13.7941 11.0022C13.0118 9.84569 11.8043 9.08039 10.4438 8.89331C10.2737 8.87632 10.0866 8.9103 9.95056 9.01235C9.23627 9.53957 8.38595 9.81167 7.50157 9.81167C6.6172 9.81167 5.76687 9.53957 5.05258 9.01235C4.91651 8.9103 4.72944 8.85929 4.55938 8.89331C3.19884 9.08039 1.97436 9.84569 1.20906 11.0022C1.056 11.2233 0.919931 11.4784 0.817913 11.7165C0.766903 11.8185 0.783896 11.9376 0.834905 12.0396C0.970972 12.2777 1.14102 12.5158 1.29408 12.7199C1.53217 13.043 1.78728 13.3321 2.07641 13.6042C2.31449 13.8423 2.5866 14.0634 2.85873 14.2845C4.20225 15.2879 5.81791 15.8151 7.48458 15.8151C9.15125 15.8151 10.7669 15.2879 12.1104 14.2845C12.3825 14.0804 12.6546 13.8423 12.8927 13.6042C13.1649 13.3321 13.437 13.043 13.6751 12.7199C13.8451 12.4988 13.9982 12.2777 14.1343 12.0396C14.2192 11.9376 14.2362 11.8185 14.1852 11.7165Z'
													fill='#686868'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2431'>
													<rect
														width='15'
														height='15'
														fill='white'
														transform='translate(0 0.814453)'
													/>
												</clipPath>
											</defs>
										</svg>
										<span>4 (2+2)</span>
									</div>
									<div className={styles.roomsCount}>
										4 комн.
									</div>
								</div>
								<div className={styles.address}>
									<div className={styles.location}>
										<svg
											width='15'
											height='16'
											viewBox='0 0 15 16'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'>
											<g clip-path='url(#clip0_2831_2475)'>
												<path
													d='M12.462 3.17459C11.3632 1.4441 9.54923 0.470703 7.50853 0.470703C5.48528 0.470703 3.67132 1.4441 2.5376 3.17459C1.40388 4.86902 1.14225 7.03212 1.83993 8.92484C2.03179 9.42957 2.3283 9.95232 2.71202 10.421L7.12481 15.7927C7.22946 15.9009 7.33412 15.973 7.49109 15.973C7.64807 15.973 7.75272 15.9009 7.85737 15.7927L12.2876 10.421C12.6713 9.95232 12.9853 9.44759 13.1597 8.92484C13.8574 7.03212 13.5957 4.86902 12.462 3.17459ZM7.50853 9.55575C6.00853 9.55575 4.77016 8.27591 4.77016 6.72568C4.77016 5.17546 6.00853 3.89562 7.50853 3.89562C9.00853 3.89562 10.2469 5.17546 10.2469 6.72568C10.2469 8.27591 9.02598 9.55575 7.50853 9.55575Z'
													fill='#BDBDBD'
												/>
											</g>
											<defs>
												<clipPath id='clip0_2831_2475'>
													<rect
														width='15'
														height='15.5023'
														fill='white'
														transform='translate(0 0.470703)'
													/>
												</clipPath>
											</defs>
										</svg>
										Минск, б-р Мулявина, д. 10
									</div>
									<div
										className={`${styles.row} ${styles.addressRow}`}>
										<div className={styles.metro}>
											<svg
												width='20'
												height='22'
												viewBox='0 0 20 22'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M19.6401 15.4968H18.3812L14.4755 4.5293L9.99979 11.219L5.21594 4.6088L1.61882 15.4968H0.359905L0 16.9569H4.77911L6.65514 11.6193L10.0565 16.3138L10.0769 16.3433L10.0978 16.3138L13.3449 11.6193L15.2209 16.9569H20L19.6401 15.4968Z'
													fill='#BDBDBD'
												/>
											</svg>
											Грушевка
										</div>
										<div className={styles.district}>
											<span
												className={
													styles.circle
												}></span>
											Шабаны
										</div>
									</div>
									<div className={styles.description}>
										<p>
											Какое-то описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание Какое-то описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание Какое-то описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание Какое-то
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание квартиры, описание
											квартиры, описание квартиры,
											описание
										</p>
									</div>
									<span className={styles.line}></span>
									<div className={styles.bottom}>
										<div className={styles.addToFav}>
											<svg
												height='15px'
												width='15px'
												version='1.1'
												id='Layer_1'
												viewBox='0 0 512.002 512.002'>
												<path
													fill='#FF877F'
													d='M54.039,272.547c-54.903-54.903-54.903-144.222,0-199.125c26.59-26.59,61.943-41.233,99.558-41.233
	c33.502,0,66.21,12.442,92.109,35.038l10.291,9.617l9.967-9.318c26.223-22.895,58.931-35.337,92.433-35.337
	c37.615,0,72.969,14.643,99.558,41.233c54.903,54.903,54.903,144.222,0,199.125L255.998,474.506L54.039,272.547z'
												/>
												<path
													fill='#573A32'
													d='M358.398,19.389c-36.779,0-73.259,13.662-102.4,39.919c-29.15-26.257-65.621-39.919-102.4-39.919
	c-39.313,0-78.618,14.993-108.612,44.988c-59.981,59.981-59.981,157.235,0,217.225l211.012,211.012L467.01,281.601
	C527,221.612,527,124.366,467.01,64.377C437.016,34.382,397.711,19.389,358.398,19.389z M448.911,263.502L255.998,456.406
	L63.085,263.502c-49.903-49.911-49.903-131.115,0-181.018c24.175-24.175,56.32-37.487,90.513-37.487
	c31.206,0,60.399,11.563,83.695,31.889l18.705,17.485l18.714-17.493c23.296-20.318,52.489-31.889,83.686-31.889
	c34.193,0,66.33,13.312,90.513,37.487C498.814,132.387,498.814,213.59,448.911,263.502z'
												/>
											</svg>
										</div>
										<div className={styles.contacts}>
											<svg
												width='16'
												height='15'
												viewBox='0 0 16 15'
												fill='none'
												xmlns='http://www.w3.org/2000/svg'>
												<path
													d='M10.7275 0L5.2729 0C4.33199 0 3.56836 0.763626 3.56836 1.70454V13.2955C3.56836 14.2364 4.33199 15 5.2729 15H10.7275C11.6684 15 12.432 14.2364 12.432 13.2955V1.70454C12.432 0.763626 11.6684 0 10.7275 0ZM8.00019 14.3182C7.43427 14.3182 6.97746 13.8614 6.97746 13.2955C6.97746 12.7295 7.43427 12.2727 8.00019 12.2727C8.56611 12.2727 9.02292 12.7295 9.02292 13.2955C9.02292 13.8614 8.56608 14.3182 8.00019 14.3182ZM11.0684 11.5909H4.93201V2.04546H11.0684V11.5909Z'
													fill='#664EF9'
												/>
											</svg>
											<span>Контакты</span>
										</div>
										<div className={styles.more}>
											Подробнее
										</div>
									</div>
								</div>
							</div>
						</div>
					</div>
				</div>
			</Container>
			
		</Layout>
	)
}

export default Catalog
